ensemble-learning/test_cases/squareDuct-DNS/nnfoam_inputs/foam_base/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   nonuniform List<scalar> 
2500
(
0.0111141
0.0125411
0.0159418
0.0216238
0.0297576
0.0403456
0.0532311
0.0681448
...
)
;

boundaryField
{
    bottomWall
    {
        lowReCorrection 0;
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
50
(
0.0111141
0.0125411
0.0159418
0.0216238
0.0297576
0.0403456
0.0532311
0.0681448
...
)
;
    }
    leftWall
    {
        lowReCorrection 0;
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
50
(
0.0111141
0.0125411
0.0159418
0.0216238
0.0297576
0.0403456
0.0532311
0.0681448
...
)
;
    }
    topSym
    {
        type            symmetryPlane;
    }
    rightSym
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
