ensemble-learning/test_cases/squareDuct-DNS/nnfoam_inputs/foam_base/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "1";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<tensor> 
2500
(
(0 0 0 0.522848 -1.90316e-12 -1.14437e-12 0.522848 -1.14437e-12 -1.90316e-12)
(-1.60729e-18 5.8473e-30 1.46183e-30 0.450711 2.82668e-13 6.70091e-13 1.44811 -1.82863e-12 -1.022e-12)
(0 0 0 0.419793 8.52011e-13 2.98257e-13 2.36332 -8.939e-13 -3.9979e-13)
(-5.68921e-18 0 1.61697e-31 0.399132 3.08842e-13 6.06636e-14 3.28444 -4.49548e-13 -1.75052e-13)
(0 0 0 0.381762 1.16152e-13 1.97068e-14 4.21755 -2.42238e-13 -6.67274e-14)
(0 2.86173e-31 -3.57717e-32 0.36445 5.05818e-14 5.46069e-15 5.16225 -1.26903e-13 -1.75538e-14)
(9.47168e-18 -6.73004e-32 3.36502e-32 0.345676 2.08234e-14 -3.65105e-16 6.11361 -6.63258e-14 4.19774e-17)
(0 0 0 0.325093 8.7044e-15 -1.48996e-15 7.06407 -3.48619e-14 4.76101e-15)
...
)
;

boundaryField
{
    bottomWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
50
(
(0 0 0 0.575752 -3.12447e-12 -3.12448e-12 0.522848 -1.14437e-12 -1.90316e-12)
(1.60729e-18 -1.46183e-30 -5.8473e-30 1.54527 -1.40032e-12 -4.53116e-12 0.450711 6.70092e-13 2.82675e-13)
(0 0 0 2.49155 -2.94002e-13 -1.79592e-12 0.419793 2.98255e-13 8.52028e-13)
(0 0 0 3.443 -7.93757e-14 -7.30807e-13 0.399132 6.06636e-14 3.08862e-13)
(0 0 -6.0843e-31 4.40995 -6.8406e-15 -3.32129e-13 0.381762 1.97067e-14 1.1617e-13)
(0 0 0 5.39362 1.98902e-14 -1.43817e-13 0.36445 5.46122e-15 5.05997e-14)
(9.47168e-18 0 -6.73004e-32 6.38936 2.20646e-14 -6.05719e-14 0.345676 -3.63863e-16 2.08355e-14)
(0 0 0 7.38918 1.75865e-14 -2.49988e-14 0.325093 -1.49291e-15 8.71376e-15)
...
)
;
    }
    leftWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
50
(
(0 0 0 0.522848 -1.90316e-12 -1.14437e-12 0.575752 -3.12447e-12 -3.12448e-12)
(-1.60729e-18 5.8473e-30 1.46183e-30 0.450711 2.82668e-13 6.70091e-13 1.54527 -4.53116e-12 -1.40033e-12)
(0 0 0 0.419793 8.52011e-13 2.98257e-13 2.49155 -1.79594e-12 -2.94009e-13)
(-5.68921e-18 0 1.61697e-31 0.399132 3.08842e-13 6.06636e-14 3.443 -7.30884e-13 -7.93802e-14)
(0 0 0 0.381762 1.16152e-13 1.97068e-14 4.40995 -3.32249e-13 -6.84844e-15)
(0 2.86173e-31 -3.57717e-32 0.36445 5.05818e-14 5.46069e-15 5.39362 -1.43988e-13 1.98863e-14)
(9.47168e-18 -6.73004e-32 3.36502e-32 0.345676 2.08234e-14 -3.65105e-16 6.38936 -6.07894e-14 2.20536e-14)
(0 0 0 0.325093 8.7044e-15 -1.48996e-15 7.38918 -2.52392e-14 1.75757e-14)
...
)
;
    }
    topSym
    {
        type            symmetryPlane;
    }
    rightSym
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
