ensemble-learning/test_cases/squareDuct-DNS/nnfoam_inputs/foam_base/0/timeScale
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      timeScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 1 0 0 0 0];


internalField   nonuniform List<scalar> 
2500
(
0.110684
0.106316
0.0981439
0.0886608
0.0797094
0.0720185
0.065663
0.0604735
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.110684
0.106316
0.0981439
0.0886608
0.0797094
0.0720185
0.065663
0.0604735
...
)
;
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.110684
0.106316
0.0981439
0.0886608
0.0797094
0.0720185
0.065663
0.0604735
...
)
;
    }
    topSym
    {
        type            symmetryPlane;
    }
    rightSym
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
